NewappUdemy/app/controllers/blogs_controller.rb

INSERT INTO "blogs" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Cian "], ["body", "Hackett"], ["created_at", "2018-03-04 02:20:27.224655"], ["updated_at", "2018-03-04 02:20:27.224655"]]
---
  def create
    @blog = Blog.new(blog_params)

    respond_to do |format|
      if @blog.save

SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_blog
      @blog = Blog.find(params[:id])