NewappUdemy/app/controllers/portfolios_controller.rb

SELECT "portfolios".* FROM "portfolios"
---
  def index
    @portfolio_items = Portfolio.all

INSERT INTO "portfolios" ("title", "subtitle", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "cian"], ["subtitle", "hackett"], ["body", "Yup out of that"], ["created_at", "2018-03-29 20:28:44.468842"], ["updated_at", "2018-03-29 20:28:44.468842"]]
---
  def create
    @portfolio_item = Portfolio.new(params.require(:portfolio).permit(:title, :subtitle, :body))

    respond_to do |format|
      if @portfolio_item.save

SELECT  "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
  def edit
    @portfolio_item = Portfolio.find(params[:id])

SELECT  "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "portfolios" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "portfolios"."id" = ?
---
  def update
    @portfolio_item = Portfolio.find(params[:id])
    respond_to do |format|
      if @portfolio_item.update(params.require(:portfolio).permit(:title, :subtitle, :body))

SELECT  "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
  def show
      @portfolio_item = Portfolio.find(params[:id])

SELECT  "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
DELETE FROM "portfolios" WHERE "portfolios"."id" = ?  [["id", 5]]
---
  def destroy
      #perform the look up
      @portfolio_item = Portfolio.find(params[:id])
      #destroy/delete to record
      @portfolio_item.destroy